20220915113315-jax_dispatcher.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JAX dispatcher</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">JAX dispatcher</h1>

<div id="outline-container-org6fe7f95" class="outline-2">
<h2 id="org6fe7f95">Static arguments</h2>
<div class="outline-text-2" id="text-org6fe7f95">
</div>
<div id="outline-container-org4dfa857" class="outline-3">
<h3 id="org4dfa857">Where they are needed</h3>
<div class="outline-text-3" id="text-org4dfa857">
<ul class="org-ul">
<li><code>shape</code> parameters</li>
<li>Scan's <code>length</code> parameter</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org73b6a6a" class="outline-2">
<h2 id="org73b6a6a">Hashable static arguments to JIT compiled function</h2>
<div class="outline-text-2" id="text-org73b6a6a">
<p>
i.e. no list, numpy array.
</p>
</div>
</div>

<div id="outline-container-orgfab9d3c" class="outline-2">
<h2 id="orgfab9d3c">TypeError: Shape</h2>
<div class="outline-text-2" id="text-orgfab9d3c">
<p>
Related issues:
</p>
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aesara/issues/702">https://github.com/aesara-devs/aesara/issues/702</a></li>
</ul>


<p>
There are two underlying issues:
</p>
<ul class="org-ul">
<li>JAX needs shapes to be determined at tracing time.</li>
<li><p>
Random variables need size specified as tuples (see <a target='_blank' rel='noopener noreferrer' class='external' href="https://jax.readthedocs.io/en/latest/_autosummary/jax.random.dirichlet.html#jax.random.dirichlet">docstring of the dirichlet distribution</a>)
</p>

<p>
Let's reproduce the example exactly:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">import</span> jax

<span style="color: #24292e;">shape</span> = jax.numpy.array([1000])

<span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">jax_funcified</span>(prng_key):
    <span style="color: #d73a49;">return</span> jax.random.normal(prng_key, shape)

<span style="color: #24292e;">key</span> = jax.random.PRNGKey(0)
<span style="color: #d73a49;">try</span>:
    jax.jit(jax_funcified)(key)
<span style="color: #d73a49;">except</span> <span style="color: #005cc5;">Exception</span> <span style="color: #d73a49;">as</span> e:
    <span style="color: #d73a49;">print</span>(e)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">import</span> jax
<span style="color: #d73a49;">import</span> numpy <span style="color: #d73a49;">as</span> np

<span style="color: #24292e;">shape</span> = np.array([10])

<span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">jax_funcified</span>(prng_key):
    <span style="color: #d73a49;">return</span> jax.random.normal(prng_key, shape)

<span style="color: #24292e;">key</span> = jax.random.PRNGKey(0)
<span style="color: #d73a49;">print</span>(jax.jit(jax_funcified)(key))
</pre>
</div></li>
</ul>



<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">import</span> jax
<span style="color: #d73a49;">import</span> numpy <span style="color: #d73a49;">as</span> np

<span style="color: #24292e;">rng_key</span> = jax.random.PRNGKey(0)
<span style="color: #d73a49;">try</span>:
    <span style="color: #d73a49;">print</span>(jax.random.normal(rng_key, shape=10))
<span style="color: #d73a49;">except</span> <span style="color: #005cc5;">Exception</span> <span style="color: #d73a49;">as</span> e:
    <span style="color: #d73a49;">print</span>(e)
<span style="color: #d73a49;">print</span>(jax.random.normal(rng_key, shape=[3]))
<span style="color: #d73a49;">print</span>(jax.random.normal(rng_key, shape=(3,)))
<span style="color: #d73a49;">print</span>(jax.random.normal(rng_key, shape=np.array([3])))
<span style="color: #d73a49;">print</span>(jax.random.normal(rng_key, shape=jax.numpy.array([3])))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">import</span> jax

<span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">fun</span>(x):
    <span style="color: #24292e;">rng_key</span> = jax.random.PRNGKey(0)
    <span style="color: #d73a49;">return</span> jax.random.normal(rng_key, shape=x)

<span style="color: #d73a49;">try</span>:
    jax.jit(fun)(1)
<span style="color: #d73a49;">except</span> <span style="color: #005cc5;">Exception</span> <span style="color: #d73a49;">as</span> e:
    <span style="color: #d73a49;">print</span>(f<span style="color: #032f62;">"shape as int: {e}"</span>)

<span style="color: #d73a49;">try</span>:
    jax.jit(fun)([1, 2])
<span style="color: #d73a49;">except</span> <span style="color: #005cc5;">Exception</span> <span style="color: #d73a49;">as</span> e:
    <span style="color: #d73a49;">print</span>(f<span style="color: #032f62;">"shape as list: {e}"</span>)

<span style="color: #d73a49;">try</span>:
    jax.jit(fun)((1, 2))
<span style="color: #d73a49;">except</span> <span style="color: #005cc5;">Exception</span> <span style="color: #d73a49;">as</span> e:
    <span style="color: #d73a49;">print</span>(f<span style="color: #032f62;">"shape as tuple: {e}"</span>)

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">using static_argnums</span>
<span style="color: #24292e;">res</span> = jax.jit(fun, static_argnums=(0,))((1, 2))
<span style="color: #d73a49;">print</span>(f<span style="color: #032f62;">"shape as tuple (static argnum): {res}"</span>)

<span style="color: #d73a49;">try</span>:
    <span style="color: #24292e;">res</span> = jax.jit(fun, static_argnums=(0,))([1, 2])
<span style="color: #d73a49;">except</span> <span style="color: #005cc5;">Exception</span> <span style="color: #d73a49;">as</span> e:
    <span style="color: #d73a49;">print</span>(f<span style="color: #032f62;">"shape as list (static_argnums): {e}"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1188ab0" class="outline-2">
<h2 id="org1188ab0">Links to this note</h2>
<div class="outline-text-2" id="text-org1188ab0">
<ul class="org-ul">
<li><a href="./20220729163627-aesara.html">Aesara</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>